Repository: kodi-game/game.libretro.snes9x2010
Catalog: game.libretro.snes9x2010/resources/language/resource.language.*/strings.po
Languages: de_de, fi_fi, ga, zh_cn

# Addon Description
source: A port of Snes9x 1.52+ to Libretro. Rewritten in C with several optimizations and speedhacks.
de_de: Eine Portierung von Snes9x 1.52+ auf Libretro. Umgeschrieben in C mit mehreren Optimierungen und Schwingigkeitshacks.
fi_fi: Snes9x 1.52+ -käännös Libretrolle. Koodattu uudelleen C-kielellä sisältäen useita optimointeja ja pikahakkerointeja.
ga: Port de Snes9x 1.52+ go Libretro. Athscríofa i C le roinnt optamaithe agus luasghéaruithe.
zh_cn: 一个针对 Libretro 的 Snes9x 1.52+ 移植。用 C 重写，进行了多次优化和 Speed Hack。

# Addon Disclaimer
source: Icon credit: HarryBana (harrybana.deviantart.com)
de_de: Symbolnachweis: HarryBana (harrybana.deviantart.com)
fi_fi: Kuvakkeen lähde: HarryBana (harrybana.deviantart.com)
ga: Creidmheas deilbhín: HarryBana (harrybana.deviantart.com)
zh_cn: 图标来源：HarryBana（harrybana.deviantart.com）

# #30000
source: Settings
fi_fi: Asetukset

# #30001
source: Console Region (Restart)
de_de: Konsolenregion (Neustart erforderlich)
fi_fi: Konsolin alue (uudelleenkäynnistys)
ga: Réigiún Consóil (Atosaigh)
zh_cn: 控制台区域（重新启动）

# #30002
source: Preferred Aspect Ratio
de_de: Bevorzugtes Seitenverhältnis
fi_fi: Ensisijainen kuvasuhde
ga: Cóimheas Gné is Fearr
zh_cn: 首选纵横比

# #30003
source: Set Autofire Pulse
de_de: Autofeuerimpuls festlegen
fi_fi: Aseta automaattilaukaisun pulssi
ga: Socraigh Pulse Uath-tine
zh_cn: 设置自动开火脉冲

# #30004
source: Blargg NTSC Filter
fi_fi: Blargg NTSC -suodatin
ga: Scagaire NTSC Blargg
zh_cn: Blargg NTSC 滤波器

# #30005
source: Frameskip
fi_fi: Kuvaohitus
ga: Fráma-léim
zh_cn: 帧跳过

# #30006
source: Frameskip Threshold (%)
de_de: Frameskip-Schwellenwert (%)
fi_fi: Kuvaohituskynnys (%)
ga: Tairseach Léim Fráma (%)
zh_cn: 帧跳过阈值（%）

# #30007
source: SuperFX Overclock
de_de: SuperFX-Übertaktung
fi_fi: SuperFX-ylikellotus
ga: Róchlogáil SuperFX
zh_cn: SuperFX 超频

# #30008
source: Reduce Slowdown (Hack, Unsafe)
de_de: Verlangsamung verringern (Hack, unsicher)
fi_fi: Vähennä hidastusta (hakkerointi, turvaton)
ga: Laghdaigh Moilliú (Hack, Neamhshábháilte)
zh_cn: 减少减速（Hack、不安全）

# #30009
source: Reduce Flickering (Hack, Unsafe)
de_de: Flackern verringern (Hack, unsicher)
fi_fi: Vähennä välkettä (hakkerointi, turvaton)
ga: Laghdaigh Flickering (Hack, Neamhshábháilte)
zh_cn: 减少闪烁（Hack、不安全）

# #30010
source: Block Invalid VRAM Access (Restart)
de_de: Ungültigen VRAM-Zugriff blockieren (Neustart erforderlich)
fi_fi: Estä virheellinen VRAM-käyttö (uudelleenkäynnistys)
ga: Bac a chur ar Rochtain Neamhbhailí VRAM (Atosaigh)
zh_cn: 阻止无效的 VRAM 访问（重新启动）

# Addon Summary
source: Nintendo - SNES / SFC (Snes9x 2010)
zh_cn: 任天堂 - SNES / SFC (Snes9x 2010)
